<!DOCTYPE html>
<html lang="fa" dir="rtl">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>زبانHTML</title>
  </head>
  <body>
    <h1>شروع برنامه نویسی وب</h1>
    <a href="#">وبلاگ</a>
    <a href="#">چالش ها</a>
    <a href="#">درباره ما</a>
    <a href="#">راهنما</a>
    <h2>زبان پایه وب:HTML</h2>
    <img src="./img/2.png" width="390" height="250" alt="none" />
    <p>
      تمام وب سایت ها و برنامه های کاربردی وب مدرن با استفاده از سه فناوری اساسی
      ساخته می شوند: HTML، CSS و جاوا اسکریپت. اینها زبانهای وب هستند. در این
      پست، بیایید روی HTML تمرکز کنیم. ما یاد خواهیم گرفت که HTML چیست و چرا شما
      نیز باید آن را یاد بگیرید.
    </p>
    <img src="./img/cod.png" alt="code" width="400" height="250" />
    <h3>HTML چیست؟</h3>
    <p>
      HTML مخفف <b>H</b>yper<b>T</b>ext <b>M</b>arkup <b>L</b>anguage . این یک
      زبان نشانه گذاری است که توسعه دهندگان وب برای ساختار و توصیف محتوای یک
      صفحه وب (نه یک زبان برنامه نویسی) از آن استفاده می کنند. HTML شامل عناصری
      است که انواع مختلف محتوا را توصیف می کند: پاراگراف ها، پیوندها، سرفصل ها،
      تصاویر، ویدئوها، و غیره. مرورگرهای وب HTML را درک می کنند و کد HTML را به
      عنوان وب سایت ارائه می کنند. در HTML، هر المان از 3 بخش تشکیل شده است:
    </p>
    <ol>
      <li>تگ شروعی</li>
      <li>تگ پایانی</li>
      <li>خود عنصر</li>
    </ol>
    <p>
      میتوانید مطالب بیشتر رادر
      <a
        href="https://developer.mozilla.org/en-US/docs/Web/HTML"
        target="_blank"
        >MDN</a
      >
      مطالعه کنید
    </p>
    <img src="./img/3.png" alt="im3" height="300" width="400" />

    <h3>چرا باید HTML را بیاموزید؟</h3>
    <p>
      دلایل بی‌شماری برای یادگیری زبان بنیادی وب وجود دارد. در اینجا 5 تا از
      آن‌ها آمده است:
    </p>
    <ul>
      <li>برای قادر بودن به استفاده از زبان اصلی توسعه وب</li>
      <li>
        رای دستیاری در ساخت وب‌سایت‌های زیبا به جای وابستگی به ابزارهایی مانند
        Worpress یا Wix
      </li>
      <li>رای ساخت برنامه‌های وب</li>
      <li>برای جلب توجه دوستان</li>
      <li>برای لذت بردن 😃</li>
    </ul>
    <h4>پست‌های مرتبط</h4>
    <ul>
      <li>
        <img src="./img/web.png" alt="WEB" height="100" width="100" />
        <a href="#">توسعه وب</a>
        <br />
        <p><b>همه چیز درباره ورود به دنیای توسعه وب‌...</b></p>
      </li>
      <li>
        <img src="./img/CSS.png" alt="CSS" width="100" height="100" />
        <a href="#"> شروعCSS </a>
        <br />
        <p><b>قدم دوم توسعه وب .همه چیز راجب CSS </p>
      </li>
      <li>
        <img src="./img/js0.png" alt="JS" height="100" width="100" />
        <a href="#">زبان جاوا اسکریپت</a>
        <br />
        <p><b>همه چیز راجب جاوا اسکریپت</b></p>
      </li>
    </ul>
    <br>
    <br>
    <br>
    <footer> CreatedBy:S.Mostsfa.H<br>©Copyright 2024 </footer>

  </body>
</html>
